<<<<<<< HEAD
# ცვლადები
a = 10
b = 5
c = 7
d = 10
e = 3.5
f = True
g = False

# 1. შედარების და ლოგიკური ოპერატორების კომბინაცია
print((a > b) and (c < d))            # True

# 2. შედარების და ლოგიკური ოპერატორების კომბინაცია
print((a == d) or (b > c))            # True

# 3. შედარების და ლოგიკური ოპერატორების კომბინაცია
print((a != c) and (d >= b))          # True

# 4. შედარების და ლოგიკური ოპერატორების კომბინაცია
print((b < c) or (e <= a))            # True

# 5. შედარების და ლოგიკური ოპერატორების კომბინაცია
print((a < b) or (f and g))           # False

# 6. შედარების და ლოგიკური ოპერატორების კომბინაცია
print((f or g) and (a >= d))          # True

# 7. შედარების და ლოგიკური ოპერატორების კომბინაცია
print((a > b) and (e < b) and (d != c)) # True

# 8. შედარების და ლოგიკური ოპერატორების კომბინაცია
print((a == d) or (f and (c <= b)))   # True

# 9. შედარების და ლოგიკური ოპერატორების კომბინაცია
print((not g) and (e < a) and (c != d)) # True

# 10. შედარების და ლოგიკური ოპერატორების კომბინაცია
print((a != b) or (d == c) or (f and not g)) # True
=======
# ცვლადები
a = 10
b = 5
c = 7
d = 10
e = 3.5
f = True
g = False

# 1. შედარების და ლოგიკური ოპერატორების კომბინაცია
print((a > b) and (c < d))            # True

# 2. შედარების და ლოგიკური ოპერატორების კომბინაცია
print((a == d) or (b > c))            # True

# 3. შედარების და ლოგიკური ოპერატორების კომბინაცია
print((a != c) and (d >= b))          # True

# 4. შედარების და ლოგიკური ოპერატორების კომბინაცია
print((b < c) or (e <= a))            # True

# 5. შედარების და ლოგიკური ოპერატორების კომბინაცია
print((a < b) or (f and g))           # False

# 6. შედარების და ლოგიკური ოპერატორების კომბინაცია
print((f or g) and (a >= d))          # True

# 7. შედარების და ლოგიკური ოპერატორების კომბინაცია
print((a > b) and (e < b) and (d != c)) # True

# 8. შედარების და ლოგიკური ოპერატორების კომბინაცია
print((a == d) or (f and (c <= b)))   # True

# 9. შედარების და ლოგიკური ოპერატორების კომბინაცია
print((not g) and (e < a) and (c != d)) # True

# 10. შედარების და ლოგიკური ოპერატორების კომბინაცია
print((a != b) or (d == c) or (f and not g)) # True
>>>>>>> 6c69066f25324131b2c5c26cb4561a7591ba12a0
